Tutorials-3.0.0/incompressible/Transient/cylinder-re100-1/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
	type		fixedValue;
	value		uniform 300;
    }
    
    outlet
    {
	type		zeroGradient;
    }
    
    tube-walls
    {
	type		zeroGradient;
    }
    
    cyl-walls
    {
	type		zeroGradient;
    }
    
    defaultFaces
    {
	type		empty;
    }
}


// ************************************************************************* //
